Tekla Open API Reference for Tekla Structures 2025
AnalysisNode Properties
The AnalysisNode type exposes the following members.
Properties
Name | Description
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
CoordinateSystem
 The coordinate system of the analysis node.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
IsUserNode
 Indicates whether the analysis node is a user node.
IsUserSupport
 Indicates whether the analysis node has a user node.
Label
 The label of the analysis node.
Position
 The position of the analysis node (in the global coordinate system).
Support
 The support of the analysis node.
Top
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace